app/controllers/biz/bingli_info_controller.rb

SELECT * FROM `bingli_infos` WHERE (keshi_id= 1) ORDER BY id LIMIT 0, 5
SELECT * FROM `keshis`
---
  def index
    #params[:keshi]=1 unless params[:keshi]
    @bingli_infos=BingliInfo.paginate :page=>params[:page],:order=>'thetime desc',:per_page => 10#,:conditions=>["keshi_id= ?",params[:keshi]]

SELECT * FROM `binglis` WHERE (`binglis`.`id` = 2)
SELECT * FROM `users` WHERE (`users`.`id` = 16) LIMIT 1
SELECT `bingli_infos`.id FROM `bingli_infos` INNER JOIN `bingli_infos_users` ON `bingli_infos`.id = `bingli_infos_users`.bingli_info_id WHERE (`bingli_infos`.`id` = 1) AND (`bingli_infos_users`.user_id = 16 ) LIMIT 1
SELECT * FROM `bingli_comments` WHERE (bingli_info_id ='1') LIMIT 0, 10
---
  def showOne
    @bingli_info=BingliInfo.find(params[:id],:include=>[:bingli,:user])
    @bingli=@bingli_info.bingli
    @bingli_comments=BingliComment.paginate :conditions=>["bingli_info_id =:bingli_info_id",{:bingli_info_id=>params[:id]}],:per_page=>10,:page=>params[:page]

INSERT INTO `bingli_infos` (`title`, `keshi_id`, `user_id`, `catelog_id`, `thetime`, `rank_num`, `bingli_id`, `bingli_comments_count`) VALUES('aa', 1, 16, 3, '2010-03-30 14:48:18', 0, 2, 0)
INSERT INTO `binglis` (`xianbingshi`, `buchong`, `chubu_has`, `attachment_has`, `yiwen_has`, `final`, `marriage`, `yibanqingkuang`, `zongbuchong`, `zhuyaozhengzhuang`, `sex`, `jiwang`, `zhusu`, `tigejiancha`, `fuzhu_has`, `yibanbuchong`, `age`) VALUES('-现病史－等待dfd', '', 1, NULL, 1, 'adffdfdfdf', 0, '', 'aaaffff', '', 1, '-既往史－fdf', '得到的', '-体格检查－dfdf', NULL, NULL, NULL)
---
  def save
        @bingli_info=BingliInfo.new(params[:bingli_info])
		@bingli_info.user=current_user
		@bingli_info.thetime=Time.new

        # process_yiwen params,@bingli
        # process_chubu params,@bingli
        # process_fuzhu params,@bingli unless params[:fuzhu].blank?
# params[:bingli_info][:catelog_id]=0
#         @bingli.bingli_info=BingliInfo.new(params[:bingli_info])
#         @bingli.bingli_info.user=current_user
#         @bingli.bingli_info.thetime=Time.new
        # process_bingli_info params,@bingli
        if  @bingli_info.save