app/controllers/misc/search_controller.rb

SELECT * FROM `bingli_infos` WHERE (keshi_id = '1') ORDER BY bingli_comments_count desc LIMIT 0, 10
---
  def do_search
    @bingli_infos = case params[:type]
  when "tag" then @bingli_infos=BingliInfo.paginate_by_sql(["SELECT * FROM tags_bingli_infos t right join bingli_infos t2 on (t.bingli_info=t2.id) where tag_id=:tag_id",{:tag_id=>params[:id]}],:page => params[:page], :per_page => 3)
    render :template => "misc/search/do_search"
    return
      when "fine" then BingliInfo.paginate(:page=>params[:page],:conditions=>["rank_num>=#{AppConfig[:fineNum]} and rank_num < #{AppConfig[:perfectNum]} and keshi_id=?",params[:keshi]])