app/controllers/admin_controller.rb

  def pages
    @widgets = Widget.find(:all)
    @layouts = WidgetLayout.find(:all)
    @pages = Page.find(:all)
---
SELECT * FROM `widgets` WHERE (`widgets`.`id` = 1)
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def content_edit
    @html_content = HtmlContent.find(params[:id])
---
SELECT * FROM `html_contents` WHERE (`html_contents`.`id` = 1)

  def layout_edit
    @widget_layout = WidgetLayout.find(params[:id])
---
SELECT * FROM `widget_layouts` WHERE (`widget_layouts`.`id` = 1)

  def save_network
    network = Network.find(params[:id])
    if params[:network_name]
      network.update_attributes(:name => params[:network_name])
---
SELECT * FROM `networks` WHERE (`networks`.`id` = 1)
UPDATE `networks` SET `updated_at` = '2010-03-29 15:48:42', `description` = '医思社区，是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信是一个提供信！' WHERE `id` = 1