app/controllers/blog_posts_controller.rb

  def index
    @section = 'BLOGS'
    if params[:user_id]
      index_blog_posts_for_user
    else
      # show paginated view of all blog posts
      @blog_posts = BlogPost.paginate(:all, :page => params[:page], :order => 'created_at DESC')
---
SELECT * FROM `blog_posts` ORDER BY created_at DESC LIMIT 0, 6
SELECT count(*) AS count_all FROM `blog_posts` WHERE (published = true)

  def show
    @blog_post = BlogPost.find(params[:id])
    @blog_post.update_attribute('views', @blog_post.views+1)
---
SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
UPDATE `blog_posts` SET `views` = 1, `updated_at` = '2010-03-26 22:05:44' WHERE `id` = 1