app/controllers/book_reviews_controller.rb

  def show
    @book_review = BookReview.find(params[:id])
---
SELECT * FROM `book_reviews` WHERE (`book_reviews`.`id` = 1)

  def create
    @book_review = BookReview.new(params[:book_review])
	@book_review.user_id=current_user.id
    respond_to do |format|
      if @book_review.save
---
INSERT INTO `book_reviews` (`name`, `buy_link`, `created_at`, `image_url`, `featured`, `updated_at`, `review`, `publisher`, `user_id`, `website`, `release_date`) VALUES('aaa', 'fdfdf', '2010-03-29 11:25:07', NULL, 0, '2010-03-29 11:25:07', 'dfdfd', '1221212', NULL, 'fdfdfd', '2009-10-11')