app/controllers/events_controller.rb

SELECT * FROM `events` WHERE (start_time>now()) ORDER BY start_time ASC
SELECT * FROM `users` WHERE (`users`.`id` = 16) LIMIT 1
---
  def index
	if params[:user_id]
	@events=User.find(params[:user_id]).own_events

SELECT * FROM `events` WHERE (`events`.`id` = 3)
---
  def show
    @event = Event.find(params[:id])

INSERT INTO `events` (`name`, `city`, `end_time`, `location`, `organized_by`, `created_at`, `updated_at`, `street`, `user_id`, `website`, `phone`, `photo_id`, `description`, `event_type`, `start_time`) VALUES('111', '111', '2010-03-30 16:17:00', '11', '1111', '2010-03-30 16:17:33', '2010-03-30 16:17:33', '11', 16, '111', '111', NULL, '1111111', '1111', '2010-03-30 16:17:00')
INSERT INTO `photos` (`location`, `size`, `created_at`, `event_id`, `title`, `content_type`, `is_profile`, `thumbnail`, `updated_at`, `photo_album_id`, `group_id`, `views`, `user_id`, `parent_id`, `filename`, `height`, `description`, `width`, `view_count`) VALUES(NULL, 107734, '2010-03-30 16:17:33', NULL, NULL, 'image/jpeg', 1, NULL, '2010-03-30 16:17:33', NULL, NULL, 0, NULL, NULL, '在_2010-01-25_20.47_拍摄的照片.jpg', NULL, NULL, NULL, NULL)
SELECT * FROM `photos` WHERE (`photos`.event_id = 3) LIMIT 1
---
  def create
    sleep 4  # required for photo upload
    @event = Event.new(params[:event])
    @event.user = current_user
    respond_to do |format|
      if @event.save
        if params[:event_photo]
          # save event photo
          @event.profile_photo = ProfilePhoto.create!(:is_profile=>true, :file => params[:event_photo]) if params[:event_photo].size != 0