app/controllers/forum_posts_controller.rb

  def index
    respond_to do |format|
      format.html {
        if params[:forum_topic_id]
          @forum_topic = ForumTopic.find(params[:forum_topic_id])
		@page_title=@forum_topic.title
          @forum_posts = @forum_topic.forum_threads
        elsif current_user
          # just get posts for current user
          @forum_posts = current_user.forum_posts
        else
          redirect_to(forum_topics_url)
          return
        end
      }
      format.xml  {
        if params[:forum_topic_id]
          @forum_topic = ForumTopic.find(params[:forum_topic_id])
          @forum_posts = @forum_topic.forum_threads
        elsif params[:user_id]
          # just get posts for current user
          @forum_posts = current_user.forum_posts
        else
          @forum_posts = ForumPost.find(:all)
---
SELECT * FROM `forum_topics` WHERE (`forum_topics`.`id` = 1)
SELECT * FROM `forum_posts` WHERE (`forum_posts`.forum_topic_id = 1 AND (parent_id is null)) ORDER BY created_at DESC

  def show
    @forum_post = ForumPost.find(params[:id])
    if @forum_post.parent_id != nil
      @forum_post = ForumPost.find(@forum_post.parent_id)
    end
    @forum_post.update_attributes(:views=>@forum_post.views+1)
---
SELECT * FROM `forum_posts` WHERE (`forum_posts`.parent_id = 1)
UPDATE `forum_posts` SET `views` = 4, `updated_at` = '2010-03-30 13:57:46' WHERE `id` = 1