app/controllers/friends_controller.rb

  def index
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 17) LIMIT 1