app/controllers/groups_controller.rb

  def index
    @section = 'GROUPS'
    if params[:user_id]
      @user = User.find(params[:user_id])
      @groups = @user.groups
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `groups`

  def show
    @group = Group.find(params[:id])
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)