app/controllers/home_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`title` = 'home') LIMIT 1
SELECT id, parent_id, filename FROM `photos` WHERE (`photos`.`thumbnail` IS NULL AND `photos`.`is_profile` IS NULL) ORDER BY RAND() LIMIT 6
---
  def index
    if false #Network.find(:first) == nil
      flash[:notice] = 'Looks like you have not created a network yet.'
      redirect_to :action => 'install'
    else
      @section = 'MAIN'
      @page_name = 'home'
      @page = Page.find_by_title('home')
      @photos = Photo.find(:all, :limit=>6,
                           :select=>'id, parent_id, filename',
                           :order => Photo.connection.adapter_name == 'PostgreSQL' ? 'RANDOM()' : 'RAND()',
                           :conditions => {:thumbnail => nil, :is_profile => nil})