app/controllers/html_contents_controller.rb

SELECT * FROM `html_contents` WHERE (`html_contents`.`id` = 1)
UPDATE `html_contents` SET `updated_at` = '2010-03-29 15:50:46', `title` = '待增加功能', `body` = '待增加功能f <b>待增加功能待增加功能待增加功能待增加功能</b>.' WHERE `id` = 1
---
  def update
    @html_content = HtmlContent.find(params[:id])
    respond_to do |format|
      if @html_content.update_attributes(params[:html_content])