app/controllers/job_posts_controller.rb

  def create
    @job_post = JobPost.new(params[:job_post])
	@job_post.user_id=current_user.id
    respond_to do |format|
      if @job_post.save
---
INSERT INTO `job_posts` (`company`, `contact_name`, `created_at`, `job_title`, `featured`, `updated_at`, `user_id`, `website`, `description`, `job_id`, `end_date`, `email`) VALUES('a', 'a', '2010-03-28 16:16:19', 'a', NULL, '2010-03-28 16:16:19', 16, 'a', 'aaaa', 'a', NULL, 'a')

  def destroy
    @job_post = JobPost.find(params[:id])
    @job_post.destroy
---
SELECT * FROM `job_posts` WHERE (`job_posts`.`id` = 1)
DELETE FROM `job_posts` WHERE `id` = 1