app/controllers/links_controller.rb

  def index
    @section = 'LINKS'
    if params[:user_id]
      @user = User.find(params[:user_id])
      @links = @user.links.paginate(:all, :page => params[:page], :order => 'created_at DESC')
---
SELECT * FROM `links` ORDER BY created_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `links`