app/controllers/meet_controller.rb

  def index
    @meetings=Meeting.paginate :page=>params[:page],:order=>"thetime",:per_page => 5
---
SELECT * FROM `meetings` ORDER BY thetime LIMIT 0, 5