app/controllers/messages_controller.rb

  def index
    user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def show
    @message = Message.find(params[:id])
    if current_user == @message.recipient
      @message.update_attributes(:read=>true)
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
UPDATE `messages` SET `updated_at` = '2010-03-26 22:19:28', `read` = 1 WHERE `id` = 1

  def new
    @message = Message.new
    @recipient_id = params[:recipient_id]
    @subject = params[:subject]
    if @recipient_id == nil
      @users = User.find(:all, :conditions => "activated_at is not null")
---
SELECT * FROM `users` WHERE (`users`.`id` = 16) LIMIT 1

  def create
    @message = Message.new(params[:message])
    @message.sender_id = current_user.id
    respond_to do |format|
      if @message.save
---
INSERT INTO `messages` (`created_at`, `body`, `updated_at`, `read`, `subject`, `recipient_id`, `sender_id`) VALUES('2010-03-27 06:23:22', '<p>大家好</p>', '2010-03-27 06:23:22', 0, '大家好', 9, 16)