app/controllers/photo_albums_controller.rb

SELECT * FROM `photo_albums` WHERE (`photo_albums`.`id` = 1)
---
  def show
    @photo_album = PhotoAlbum.find(params[:id])