app/controllers/photos_controller.rb

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.user_id = 16 AND (is_profile = 1)) LIMIT 1

  def edit
    @photo = Photo.find(params[:id])
---
SELECT * FROM `photos` WHERE (`photos`.user_id = 17 AND (is_profile = 1)) LIMIT 1

  def create
    sleep 5
    @photo = Photo.new(params[:photo])
    @photo.user = current_user;
    if @photo.save
---
INSERT INTO `photos` (`location`, `size`, `created_at`, `event_id`, `title`, `content_type`, `is_profile`, `thumbnail`, `updated_at`, `photo_album_id`, `group_id`, `views`, `user_id`, `parent_id`, `filename`, `height`, `description`, `width`, `view_count`) VALUES(NULL, 5673, '2010-03-27 18:25:05', NULL, NULL, 'image/jpeg', NULL, NULL, '2010-03-27 18:25:05', NULL, NULL, 0, 17, NULL, '下载.jpeg', NULL, NULL, NULL, NULL)