app/controllers/sessions_controller.rb

  def create
    logout_keeping_session!
    user = User.authenticate(params[:login], params[:password])

    if user
	 if user.active?
      # Protects against session fixation attacks, causes request forgery
      # protection if user resubmits an earlier form using back
      # button. Uncomment if you understand the tradeoffs.
      # reset_session
      self.current_user = user
      new_cookie_flag = (params[:remember_me] == "1")
      handle_remember_cookie! new_cookie_flag
    	login_count = self.current_user.login_count
	      login_count = login_count + 1
	      self.current_user.update_attribute('login_count', login_count)
---
UPDATE `users` SET `updated_at` = '2010-03-30 05:56:40', `remember_token_expires_at` = '2010-04-13 05:56:40', `remember_token` = '4bd79743940a55d02b7ba22781ea1c75c405deed' WHERE `id` = 16