app/controllers/status_posts_controller.rb

  def create
    @status_post = StatusPost.new(params[:status_post])
    @status_post.user_id = current_user.id
    if @status_post.save
---
INSERT INTO `status_posts` (`created_at`, `body`, `updated_at`, `user_id`) VALUES('2010-03-26 22:19:15', 'aaa', '2010-03-26 22:19:15', 1)