app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (activated_at is not null) ORDER BY created_at ASC LIMIT 0, 10
SELECT count(*) AS count_all FROM `users` WHERE (activated_at is not null)
---
  def index
    # @section = 'MEMBERS'
	@users=User.paginate :page => params[:page]

SELECT * FROM `users` WHERE (`users`.`id` = 16) LIMIT 1
SELECT * FROM `pages` WHERE (`pages`.`title` = 'profile') LIMIT 1
---
  def show
    @user = User.find(params[:id])
	@page_title= params[:tap]=='favorite' ? @user.login+'--收藏的病例' : @user.login
	@bingli_infos=((params[:tap]=='favorite' ? @user.favorite_bingli_infos : @user.bingli_infos).paginate :page => params[:page_bi],:per_page => 10)

SELECT * FROM `users` WHERE (`users`.`id` = 16) LIMIT 1
---
  def edit
    if (params[:id].to_s != current_user.id.to_s)
      # can only edit your own page
      redirect_back_or_default('/')
    end
    @user = User.find(params[:id])

INSERT INTO `users` (`city`, `occupation`, `flickr`, `facebook_id`, `salt`, `name`, `created_at`, `zip`, `about_me`, `activated_at`, `blog`, `display_tweets`, `yahoo_messenger_name`, `skype_name`, `facebook_url`, `company_url`, `crypted_password`, `remember_token_expires_at`, `keshi_id`, `updated_at`, `featured`, `last_seen_at`, `password_reset_code`, `country_id`, `skills`, `show_blog_posts_on_home`, `msn_name`, `activation_code`, `api_key`, `flickr_username`, `linked_in_url`, `gtalk_name`, `posts_count`, `enabled`, `email_hash`, `sex`, `phone2`, `last_name`, `phone`, `website`, `blog_feed`, `twitter_id`, `aim_name`, `resume_url`, `login_count`, `remember_token`, `is_active`, `jifen`, `time_zone`, `organization`, `bingli_infos_count`, `zhicheng`, `login`, `state_id`, `youtube_username`, `identity_url`, `email`, `first_name`, `use_gravatar`, `receive_emails`, `bingli_comments_count`) VALUES(NULL, NULL, NULL, NULL, '0c77e20b00c024f3b0f93326ef59f48f003befe7', 'aaa', '2010-03-30 15:37:43', NULL, 'aaaaa', NULL, NULL, 0, NULL, NULL, NULL, NULL, '7031fbf3363b755bb789d67f1e619a812177f577', NULL, 0, '2010-03-30 15:37:43', 0, NULL, NULL, NULL, NULL, 1, NULL, 'd5e171114d0a9061628b2237322e498b9f31afcf', '', NULL, NULL, NULL, 0, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, 0, 0, 'UTC', NULL, 0, '', '1111', NULL, NULL, NULL, '11@dd.com', NULL, 0, 1, 0)
SELECT * FROM `roles` WHERE (`roles`.`rolename` = 'user') LIMIT 1
---
  def create
   logout_keeping_session!
	#params[:user]['keshi_id']=1
    @user = User.new(params[:user])

    # if @user.facebook_id
    #   create_facebook_user
    # else

    # if Configuration.ENABLE_SELF_REGISTRATION == false
    #   @user.enabled = false
    # end

      # create just a local user
      # sleep 4  # required for photo upload
      cookies.delete :auth_token
      @user.roles << Role.find_by_rolename('user')

SELECT * FROM `users` WHERE (`users`.`id` = 16) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-03-27 06:30:06', `about_me` = 'hahahahahahahha', `facebook_url` = '', `receive_emails` = 0, `state_id` = 1, `city` = '', `blog_feed` = '', `linked_in_url` = '', `sex` = 'F', `twitter_id` = '', `country_id` = 1, `blog` = '', `website` = '' WHERE `id` = 16
SELECT * FROM `photos` WHERE (`photos`.user_id = 16 AND (is_profile = 1)) LIMIT 1
INSERT INTO `photos` (`location`, `size`, `created_at`, `event_id`, `title`, `content_type`, `is_profile`, `thumbnail`, `updated_at`, `photo_album_id`, `group_id`, `views`, `user_id`, `parent_id`, `filename`, `height`, `description`, `width`, `view_count`) VALUES(NULL, 85544, '2010-03-27 06:30:07', NULL, NULL, 'image/jpeg', 1, NULL, '2010-03-27 06:30:07', NULL, NULL, 0, 16, NULL, '在_2010-02-10_11.52_拍摄的照片.jpg', NULL, NULL, NULL, NULL)
---
  def update
    if (params[:id].to_s != current_user.id.to_s)
      redirect_back_or_default('/')
    end
    sleep 4  # required for photo upload
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])
        if params[:user_photo] && params[:user_photo].size != 0
          # remove old profile photos
          Photo.destroy_all("user_id = " + @user.id.to_s + " AND is_profile = true")
          profile_photo = ProfilePhoto.create!(:user_id=>@user.id, :is_profile=>true, :file => params[:user_photo]) if params[:user_photo].size != 0