app/controllers/wall_posts_controller.rb

SELECT * FROM `wall_posts` WHERE (`wall_posts`.user_id = 16) ORDER BY created_at DESC
INSERT INTO `wall_posts` (`created_at`, `event_id`, `updated_at`, `group_id`, `user_id`, `sender_id`, `message`) VALUES('2010-03-30 07:22:51', NULL, '2010-03-30 07:22:51', NULL, 16, 16, '<p>＝＝＝坎坎坷坷</p>')
---
  def create
    @wall_post = WallPost.new(params[:wall_post])
    if params[:group_id]
      @wall_post.group_id = params[:group_id]
    elsif params[:event_id]
      @wall_post.event_id = params[:event_id]
    else
      @wall_post.user_id = params[:user_id]
    end
    @wall_post.sender_id = current_user.id
 @wall_post.user_id = current_user.id
    respond_to do |format|
      if @wall_post.save

SELECT * FROM `events` WHERE (`events`.`id` = 3)
SELECT * FROM `users` WHERE (`users`.`id` = 16) LIMIT 1
---
  def set_parent
    if @wall_post.group_id
      @parent = Group.find(@wall_post.group_id)
    elsif @wall_post.event_id
       @parent = Event.find(@wall_post.event_id)
    else
      @user = User.find(@wall_post.user_id)